Джира/src/Documents/Центр_Задача/Центр_Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Центр_Задача</name>
  <comment>Задачи сотрудников</comment>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадачи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.Центр_ВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Центр_Партнеры</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.Центр_Приоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавнаяЗадача</name>
    <type>
      <types>DocumentRef.Центр_Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выполнен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Метки</name>
    <attributes>
      <name>Метка</name>
      <type>
        <types>CatalogRef.Центр_МеткиЗадач</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Джира/src/InformationRegisters/Центр_ИсполнителиЗадач/Центр_ИсполнителиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Центр_ИсполнителиЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Центр_ГруппыДоступаКЗадачам</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ЗадачаВзята</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Центр_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Джира/src/Documents/Центр_Задача/Forms/ФормаОтклоненияЗадачи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПараметрПостановщик = Неопределено;
	Если Параметры.Свойство("Постановщик", ПараметрПостановщик) Тогда
		Постановщик = ПараметрПостановщик;
	КонецЕсли;
	
	ПараметрГлавныйМенеджер = Неопределено;
	Если Параметры.Свойство("ГлавныйМенеджер", ПараметрГлавныйМенеджер) Тогда
		ГлавныйМенеджер = ПараметрГлавныйМенеджер;
	КонецЕсли;
	
	ПараметрОснование = Неопределено;
	Если Параметры.Свойство("Основание", ПараметрОснование) Тогда
		Основание = ПараметрОснование;
	КонецЕсли;
	
	ПараметрАвтор = Неопределено;
	Если Параметры.Свойство("Автор", ПараметрАвтор) Тогда
		Автор = ПараметрАвтор;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтклонитьНаСервере()
	
	ТекстСообщение = "Назначенный исполнитель отказался от задачи. Причина: " + ПричинаОтказа;
	Центр_УведомленияПользователей.ОтправитьУведомлениеПользователю(Автор, ТекстСообщение, ТекущаяДатаСеанса(),
		ТекущаяДатаСеанса(), Перечисления.СпособыУстановкиВремениНапоминания.Периодически, 60, Основание);

	Если ТипЗнч(Постановщик) = Тип("СправочникСсылка.Пользователи") Тогда
		Исполнитель = Постановщик;
	Иначе
		Исполнитель = ГлавныйМенеджер;
	КонецЕсли;
	
	Менеджер = РегистрыСведений.Центр_ИсполнителиЗадач.СоздатьМенеджерЗаписи();
	Менеджер.Задача = Основание;
	Менеджер.Период = ТекущаяДатаСеанса();
	Менеджер.Исполнитель = Исполнитель;
	Менеджер.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	ОтклонитьНаСервере();
	Закрыть();
КонецПроцедуры
